_Rarzrabotki/Rarus/USO2/Catalogs/УСОERP_СценарииПланированияПроектовСтроительства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>УСОERP_СценарииПланированияПроектовСтроительства</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.СМ_ОбъектыСтроительства</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидСценария</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УСОERP_ВидыСценариевПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоСтроительства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеСтроительства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагруженИзMSProject</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗагрузкиИзMSProject</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчитыватьКритическийПуть</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЧасовКритичность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКодаСДР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НовыйВариант</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСохранения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВерсии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоловнойСценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_СценарииПланированияПроектовСтроительства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДлительностиЭтапа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/УСОERP_ВидыСценариевПланирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>УСОERP_ВидыСценариевПланирования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Базовый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Рабочий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешнийРабочий</Name>
					<Comment>Внешний рабочий (для договора с заказчиком)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Catalogs/УСОERP_СценарииПланированияПроектовСтроительства/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Проверяет уникальность по виду сценария планирования.
//
// Параметры:
//	Объект - СправочникОбъект.УСОERP_СценарииПланированияПроектовСтроительства - элемент справочника сценариев планирования
//
// Возвращаемое значение:
//	Булево - признак уникальности по виду сценария элемента справочника
//
Функция ВидСценарияУникален(Объект) Экспорт
	
	Если Объект.ВидСценария = Перечисления.УСОERP_ВидыСценариевПланирования.Рабочий Тогда // проверяем уникальность только для рабочего сценария
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	УСОERP_СценарииПланированияПроектовСтроительства.Ссылка
		|ИЗ
		|	Справочник.УСОERP_СценарииПланированияПроектовСтроительства КАК УСОERP_СценарииПланированияПроектовСтроительства
		|ГДЕ
		|	УСОERP_СценарииПланированияПроектовСтроительства.Владелец = &Владелец
		|	И УСОERP_СценарииПланированияПроектовСтроительства.Ссылка <> &Ссылка
		|	И УСОERP_СценарииПланированияПроектовСтроительства.Организация = &Организация
		|	И УСОERP_СценарииПланированияПроектовСтроительства.ВидСценария = &ВидСценария
		|	И УСОERP_СценарииПланированияПроектовСтроительства.ПометкаУдаления = ЛОЖЬ
		|	И УСОERP_СценарииПланированияПроектовСтроительства.НомерВерсии = 0");
		
		Запрос.УстановитьПараметр("Владелец", Объект.Владелец);
		Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
		Запрос.УстановитьПараметр("Организация", Объект.Организация);
		Запрос.УстановитьПараметр("ВидСценария", Объект.ВидСценария);
		
		Возврат Запрос.Выполнить().Пустой();
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции // ВидСценарияУникален()

#КонецОбласти

#Область Печать 

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПланГрафик";
	КомандаПечати.Представление = НСтр("ru = 'План-график'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	КомандаПечати.ДополнительныеПараметры.Вставить("ВыводитьМатериалы", Ложь);
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПланГрафик";
	КомандаПечати.Представление = НСтр("ru = 'План-график (с ресурсами-материалами)'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	КомандаПечати.ДополнительныеПараметры.Вставить("ВыводитьМатериалы", Истина);
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПланГрафик") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПланГрафик", НСтр("ru = 'Акт выполненных работ'"), СформироватьПечатнуюФормуПланГрафик(МассивОбъектов, ОбъектыПечати, ПараметрыПечати));
	КонецЕсли;
	
КонецПроцедуры

Функция  СформироватьПечатнуюФормуПланГрафик(МассивОбъектов, ОбъектыПечати, ПараметрыПечати)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ВыводитьМатериалы = ПараметрыПечати.ВыводитьМатериалы; 	
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_УСОERP_СценарийПланирования_ПланГрафик";
	Макет = Справочники.УСОERP_СценарииПланированияПроектовСтроительства.ПолучитьМакет("Макет");
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	УСОERP_СтроительныеРаботы.Ссылка КАК Ссылка,
	|	УСОERP_СтроительныеРаботы.ОбъемРаботы КАК ОбъемРаботы,
	|	УСОERP_СтроительныеРаботы.ЕдиницаОбъема КАК ЕдиницаОбъема,
	|	УСОERP_СтроительныеРаботы.СуммарнаяРабота КАК СуммарнаяРабота,
	|	УСОERP_СтроительныеРаботы.ЕдиницаДлительности КАК ЕдиницаДлительности,
	|	УСОERP_СтроительныеРаботы.Длительность КАК Длительность
	|ИЗ
	|	Справочник.УСОERP_СтроительныеРаботы КАК УСОERP_СтроительныеРаботы
	|ГДЕ
	|	УСОERP_СтроительныеРаботы.Владелец = &СценарийПланирования
	|	И НЕ УСОERP_СтроительныеРаботы.СуммарнаяРабота
	|	И НЕ УСОERP_СтроительныеРаботы.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	УСОERP_СтроительныеРаботы.НомерРаботыВУровне
	|ИТОГИ ПО
	|	Ссылка ИЕРАРХИЯ"; 	
	
	ПервыйДокумент = Истина;
	
	Для Каждого ЭлементМассива ИЗ МассивОбъектов Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент    = Ложь;
		
		ТаблицаПроекта =  УСОERP_ЗащищенныеФункцииСервер.РассчитатьПроект(ЭлементМассива);
		
		ОбластьМакета = Макет.ПолучитьОбласть("ОбластьЗаголовок");
		
		ОбластьМакета.Параметры.СценарийПланирования =  ""+ЭлементМассива+?(ЭлементМассива.НомерВерсии = 0,""," (№ "+ЭлементМассива.НомерВерсии+" от "+Формат(ЭлементМассива.ДатаСохранения,"ДФ=dd.MM.yyyy")+")");
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ВыводитьМатериалы = ПараметрыПечати.ВыводитьМатериалы;
		
		Если ВыводитьМатериалы Тогда
			ОбластьМакета = Макет.ПолучитьОбласть("ОбластьВыводитьМатериалы");
			ТабличныйДокумент.Вывести(ОбластьМакета);
		КонецЕсли;
			
		Запрос.УстановитьПараметр("СценарийПланирования",ЭлементМассива);
		
		ДеревоРабот = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
		
		ТабличныйДокумент.НачатьАвтогруппировкуСтрок();
		
		ВывестиДеревоРабот(ДеревоРабот,ТаблицаПроекта,Макет,ТабличныйДокумент,ПараметрыПечати.ВыводитьМатериалы);	
		
		ТабличныйДокумент.ЗакончитьАвтогруппировкуСтрок();   		
		
	КонецЦикла; 
	
	ТабличныйДокумент.ТолькоПросмотр = Истина;
	
	Возврат ТабличныйДокумент;  	
	
КонецФункции

Процедура ВывестиДеревоРабот(ДеревоРабот,ТаблицаПроекта,Макет,ТабличныйДокумент,ВыводитьМатериалы,Уровень=0)
	
	Для Каждого СтрокаДерева ИЗ ДеревоРабот.Строки Цикл
		
		Если ЗначениеЗаполнено(СтрокаДерева.Родитель) И СтрокаДерева.Родитель.Ссылка = СтрокаДерева.Ссылка Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаРаботы = ТаблицаПроекта.Найти(СтрокаДерева.Ссылка,"Работа");
		ЭтоЭтап = СтрокаДерева.СуммарнаяРабота; 
		
		Если ЭтоЭтап Тогда
			
			ОбластьМакета = Макет.ПолучитьОбласть("ОбластьЭтап");
			ОбластьМакета.Параметры.ЕдиницаДлительности = СтрокаДерева.ЕдиницаДлительности;
			
		Иначе
			
			ОбластьМакета = Макет.ПолучитьОбласть("ОбластьСтрока");
			ОбластьМакета.Параметры.Заполнить(СтрокаДерева);
			
		КонецЕсли; 
		
		ОбластьМакета.Параметры.Заполнить(СтрокаРаботы);
		
		ОбластьМакета.Параметры.КодСДР = УСОERP_УправлениеСтроительнымПроизводством.ПолучитьКодСДР(СтрокаРаботы.Работа);
		
		ТабличныйДокумент.Вывести(ОбластьМакета,Уровень);		
		
		ВывестиДеревоРабот(СтрокаДерева,ТаблицаПроекта,Макет,ТабличныйДокумент,ВыводитьМатериалы,Уровень+1);
		
		Если НЕ ЭтоЭтап И ВыводитьМатериалы Тогда
			
			Если СтрокаРаботы.Работа.Материалы.Количество()  Тогда
				
				ОбластьМакета = Макет.ПолучитьОбласть("ОбластьВидЗатрат");
				ОбластьМакета.Параметры.ВидЗатрат= "Материалы";
				
				ТабличныйДокумент.Вывести(ОбластьМакета,Уровень);
				
				Для Каждого СтрокаНоменклатуры ИЗ СтрокаРаботы.Работа.Материалы Цикл
					
					ОбластьМакета = Макет.ПолучитьОбласть("ОбластьНоменклатура");
					ОбластьМакета.Параметры.Заполнить(СтрокаНоменклатуры);
					Если НЕ ЗначениеЗаполнено(СтрокаНоменклатуры.Упаковка) Тогда
						ОбластьМакета.Параметры.Упаковка = СтрокаНоменклатуры.Номенклатура.ЕдиницаИзмерения;
					КонецЕсли;
					
					ТабличныйДокумент.Вывести(ОбластьМакета,Уровень+1);
					
				КонецЦикла;  				
				
			КонецЕсли;
			
			Если СтрокаРаботы.Работа.Ресурсы.Количество() Тогда
				
				ОбластьМакета = Макет.ПолучитьОбласть("ОбластьВидЗатрат");
				ОбластьМакета.Параметры.ВидЗатрат= "Ресурсы";
				
				ТабличныйДокумент.Вывести(ОбластьМакета,Уровень+1);
				
				Для Каждого СтрокаРесурс ИЗ СтрокаРаботы.Работа.Ресурсы Цикл
					
					ОбластьМакета = Макет.ПолучитьОбласть("ОбластьРесурсы");
					
					ОбластьМакета.Параметры.Заполнить(СтрокаРесурс);
					ОбластьМакета.Параметры.Трудоемкость = СтрокаРаботы.ДлительностьВЧасах*СтрокаРесурс.Ресурс.Рабочие.Количество()*СтрокаРесурс.Количество*СтрокаРесурс.ЗагрузкаПроцент/100;
				    ОбластьМакета.Параметры.Машиноемкость = СтрокаРаботы.ДлительностьВЧасах*СтрокаРесурс.Ресурс.Механизмы.Количество()*СтрокаРесурс.Количество*СтрокаРесурс.ЗагрузкаПроцент/100;
					
					ТабличныйДокумент.Вывести(ОбластьМакета,Уровень+1);  					
					
				КонецЦикла; 				
				
			КонецЕсли; 		
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры 

#КонецОбласти

#КонецЕсли
